# Festival Project - SQL Project

Through this project, we are trying to create a database for an annual festival that occurs at Burg Lohra in Germany. This event has already taken place a few times and hopefully will take place in the future as well. We are trying to transfer their records which are maintained as Excel into a SQL database.
First, we normalize the data and identify various tables into which the data can be distributed. The data is then read from the input file and is distributed to various tables by using a for-loop and some procedures which are used to fetch data from other tables. Data is stored for each participant even they are registered as a family.
Each participant while registering must select a type of stay, food and drinks from the provided options. A payment table will collect this information which will be used later to calculate the billing amount based on these selections. If in case the participants cancel the registration, a trigger will automatically update this information on the payment table. A procedure is used to calculate the billing amount which also ensures that the billing amount is not generated for the canceled participants. Finally, we try to answer some questions using the query statements. The answers would help the organizers to prepare for future events.
At the end of this project we will learn how to use Jupyter to connect to MySQL and execute the following tasks:

- create database,
- create tables,
- add various constraints,
- add relationship among tables,
- insert data into the table,
- fetch data from the table,
- create procedures, functions and triggers,
- find answers from a single table or multiple tables by joining them.

### Schema Diagram

The diagram shows the various tables created after normalization. It also shows the relationship between various tables. The columns in the red color are the primary key for respective tables.

![image](event_planner_diagram.jpg)

### Importing the required libraries

In [479]:
import mysql.connector as mysql
import sqlalchemy
import pymysql
import pandas as pd

### Establishing connection with mysql server

In [480]:
conn = mysql.connect(
        host ='localhost', 
        user = 'root',         # provide your user
        password = 'password') # provide your password
cursor = conn.cursor()

### Creating the databse

In [481]:
cursor.execute("""
                DROP DATABASE IF EXISTS event_planner;
                """)
cursor.execute("""
                CREATE DATABASE IF NOT EXISTS event_planner;
                """)
cursor.execute("""
                USE event_planner;
                """)

### Creating various Tables
Let's start by creating the various tables which fetch data from the input files. These tables are required to distribute the normalized data.

##### table participants
As the name suggests, this table stores the information about each participant. Apart from the input data, it also fetches ids from tables address, contact and roll which will be created next.

In [482]:
# Create table participants
cursor.execute("""
                CREATE TABLE participants(
                participant_id INT NOT NULL UNIQUE, 
                first_name NVARCHAR(30) NOT NULL, 
                last_name NVARCHAR(30) NOT NULL,
                address_id INT,
                contact_id INT,
                booking_date DATE NOT NULL,
                cancellatation_date DATE DEFAULT NULL,
                roll_id INT,
                PRIMARY KEY (participant_id));
                """)

##### table address
This table stores the address information of the participants. The unique index constraint prevents the duplication of the data.

In [483]:
# Create table address
cursor.execute("""
                CREATE TABLE address(
                address_id INT NOT NULL UNIQUE AUTO_INCREMENT,
                house_no VARCHAR(5) NOT NULL,
                street NVARCHAR(50) NOT NULL,
                city NVARCHAR(35) NOT NULL,
                postal_code NVARCHAR(8) NOT NULL,
                country NVARCHAR(50) NOT NULL,
                PRIMARY KEY (address_id)
                );
                """)

# Create unique index to avoid duplicate entries
cursor.execute("""
                CREATE UNIQUE INDEX inx_address
                ON address (house_no, street, city, postal_code, country);
                """)

##### table contact
This table stores the contact information of the participants. The unique index constraint prevents the duplication of the data.

In [484]:
# Create table contact
cursor.execute("""
                CREATE TABLE contact(
                contact_id INT NOT NULL UNIQUE AUTO_INCREMENT,
                email NVARCHAR(50),
                contact_number NVARCHAR(30),
                PRIMARY KEY (contact_id)
                );
                """)

# Create unique index to avoid duplicate entries
cursor.execute("""
                CREATE UNIQUE INDEX inx_contact
                ON contact (email, contact_number);
                """)

##### table roll
This table stores the roll information of the participants. This information is used later when some fun activities are planned for the participants. The unique index constraint prevents the duplication of the data.

In [485]:
# Create table roll
cursor.execute("""
                CREATE TABLE roll(
                roll_id INT NOT NULL UNIQUE AUTO_INCREMENT,
                description VARCHAR(15),
                PRIMARY KEY(roll_id)
                );
                """)

# Insert values into table roll
cursor.execute("""
                INSERT INTO roll (description)
                VALUES ('Guest')
                """)
cursor.execute("""
                INSERT INTO roll (description)
                VALUES ('Child')
                """)
cursor.execute("""
                INSERT INTO roll (description)
                VALUES ('Collaborator')
                """)

### Establishing relationship between various tables
The table participants fetches address_id and contact_id from tables address and contact respectively. So no we need to establish a relationship among these tables. We can achieve this by adding Foreign Key constraints on the columns address_id and contact_id on table participants.

In [486]:
# Create Foreign Key constraints on table participants
cursor.execute ("""
                ALTER TABLE participants
                ADD CONSTRAINT fk_participants_address
                FOREIGN KEY (address_id) REFERENCES address(address_id);
                """)

cursor.execute ("""
                ALTER TABLE participants
                ADD CONSTRAINT fk_participants_contact
                FOREIGN KEY (contact_id) REFERENCES contact(contact_id);
                """)

cursor.execute ("""
                ALTER TABLE participants
                ADD CONSTRAINT fk_participants_roll
                FOREIGN KEY (roll_id) REFERENCES roll(roll_id);
                """)

### Continuing with table creations - Creating independant tables
Now we will create the tables that are independent of the input data and for which the data pre-exists. Every participant will be tagged to each of these ids based on their selected option and then save in the table participant. The options each participant availed is can be fetched from the input file.

##### table stay:
This table has information about the various types of stay, the number of beds and the price for each bed for the respective type of stay.

In [487]:
# Create table stay
cursor.execute("""
                CREATE TABLE stay(
                stay_id INT NOT NULL UNIQUE AUTO_INCREMENT,
                type VARCHAR(10) NOT NULL,
                beds INT NOT NULL,
                price INT NOT NULL DEFAULT 0,
                PRIMARY KEY (stay_id)
                );
                """)

# Insert values into table stay
cursor.execute("""
                INSERT INTO stay(type, beds, price)
                VALUES('Tent', 30, 10)
                """)
cursor.execute("""
                INSERT INTO stay(type, beds, price)
                VALUES('Camper', 30, 10)
                """)
cursor.execute("""
                INSERT INTO stay(type, beds, price)
                VALUES('House', 140, 20)
                """)

##### table food:
This table has information about the various food options availabe with their repective price.

In [488]:
# Create table food
cursor.execute("""
                CREATE TABLE food(
                food_id INT NOT NULL UNIQUE AUTO_INCREMENT,
                type VARCHAR(20) NOT NULL,
                price INT NOT NULL DEFAULT 0,
                PRIMARY KEY (food_id)
                );
                """)

# Insert values into the table food
cursor.execute("""
                INSERT INTO food (type, price)
                VALUES ('Buffet_Veg', 20)
                """)
cursor.execute("""
                INSERT INTO food (type, price)
                VALUES ('Buffet_NonVeg', 40)
                """)
cursor.execute("""
                INSERT INTO food (type, price)
                VALUES ('Self_Catering', 0)
                """)

##### table drinks:
This table has information about the various drinks options availabe with their repective price.

In [489]:
# Create table drinks
cursor.execute("""
                CREATE TABLE drinks(
                drinks_id INT NOT NULL UNIQUE AUTO_INCREMENT,
                type VARCHAR(3) NOT NULL,
                description VARCHAR(25) NOT NULL,
                price INT NOT NULL DEFAULT 0,
                PRIMARY KEY (drinks_id)
                );
                """)

# Insert values into tabLe drinks
cursor.execute("""
                INSERT INTO drinks (type, description, price)
                VALUES ('S', 'Small', 20);                
                """)
cursor.execute("""
                INSERT INTO drinks (type, description, price)
                VALUES ('M', 'Medium', 35);                
                """)
cursor.execute("""
                INSERT INTO drinks (type, description, price)
                VALUES ('L', 'Large', 50);                
                """)
cursor.execute("""
                INSERT INTO drinks (type, description, price)
                VALUES ('XL', 'Unlimited', 100);
                """)

##### table payment:
This table combines all the information to generate the bill for each participant. It fetches the data (the ids) from the corresponding tables.

In [490]:
# Create table payment
cursor.execute("""
                CREATE TABLE payment(
                payment_id INT NOT NULL UNIQUE AUTO_INCREMENT,
                participant_id INT NOT NULL,
                stay_id INT NOT NULL,
                food_id INT NOT NULL,
                drinks_id INT NOT NULL,
                canceled BOOLEAN NOT NULL DEFAULT 0,
                PRIMARY KEY(payment_id),
                CONSTRAINT FK_paymt_pid FOREIGN KEY (participant_id) REFERENCES participants(participant_id),
                CONSTRAINT FK_paymt_sid FOREIGN KEY (stay_id) REFERENCES stay(stay_id),
                CONSTRAINT FK_paymt_fid FOREIGN KEY (food_id) REFERENCES food(food_id),
                CONSTRAINT FK_paymt_did FOREIGN KEY (drinks_id) REFERENCES drinks(drinks_id)
                );
                """)

### Creating Procedures
In table participants we need to update address_id, contact_id and roll_id for each of the participants. These ids need to be fetched from the respective tables. We can create separate procedures which will help us to achieve this. Each procedure will return the respective ids.

In [491]:
# Create procedure to fetch address_id from table address
cursor.execute("""
                CREATE PROCEDURE get_address_id(
                IN h_no VARCHAR (5),
                IN street VARCHAR(50),
                IN city VARCHAR(35),
                IN p_code VARCHAR(8),
                IN country VARCHAR(50),             
                OUT add_id INT)
                BEGIN
                    SELECT address_id INTO add_id
                    FROM address a
                    WHERE (a.house_no = h_no AND a.street = street
                    AND a.city = city AND postal_code = p_code AND a.country = country);
                END
                """)

In [492]:
# Create procedure to fetch contact_id from table contact
cursor.execute("""
                CREATE PROCEDURE get_contact_id(
                IN email VARCHAR(50),
                IN t_no VARCHAR (30),                
                OUT cont_id INT)                
                BEGIN
                    SELECT contact_id INTO cont_id
                    FROM contact c
                    WHERE c.email = email AND c.contact_number = t_no;
                END                
                """)

In [493]:
# Create procedure to get roll_id from table roll
cursor.execute("""
                CREATE PROCEDURE get_roll_id(
                IN roll VARCHAR(15),               
                OUT r_id INT)              
                BEGIN
                    SELECT roll_id INTO r_id
                    FROM roll
                    WHERE description = roll;
                END
                """)

To update table payment with ids such as stay_id, food_id and drinks_id, we need to fetch them from the respective tables. This can be achieved with the help of procedures. We pass the description or type as input parameter for the procedure and get the respective id as the output.

In [494]:
# Create procedure to get stay_id
cursor.execute("""
               CREATE PROCEDURE get_stay_id(
                IN description VARCHAR(10),              
                OUT s_id INT)
                BEGIN
                    SELECT stay_id INTO s_id
                    FROM stay 
                    WHERE type = description;
                END
                """)

In [495]:
# Create procedure to get food_id
cursor.execute("""
               CREATE PROCEDURE get_food_id(
                IN description VARCHAR(20),              
                OUT f_id INT)
                BEGIN
                    SELECT food_id INTO f_id
                    FROM food 
                    WHERE type = description;
                END
                """)

In [496]:
# Create procedure to get drinks_id
cursor.execute("""
               CREATE PROCEDURE get_drinks_id(
                IN in_type VARCHAR(3),              
                OUT d_id INT)
                BEGIN
                    SELECT drinks_id INTO d_id
                    FROM drinks 
                    WHERE type = in_type;
                END
                """)

### Creating Trigger

In table participants, we have a column 'cancellation_date'. The default value for this is NULL. Similarly, for table payment, there is a column with 'canceled'. This column is of datatype Boolean and the default value is 0. If some participants cancel their participation, then the 'cancellation_date' column will be updated accordingly. This modification should automatically update the canceled column in the table payment to 1. This can be achieved by a trigger. Let's now create the trigger on table payment to achieve our goal.

In [497]:
# Create trigger to update table payment based on booking cancellation
cursor.execute("""
                CREATE TRIGGER booking_cancellation
                AFTER UPDATE
                ON participants FOR EACH ROW
                BEGIN
                    DECLARE can_date DATE; 
                    SET can_date = old.cancellatation_date;
                    
                    IF can_date IS NOT NULL THEN
                        UPDATE payment
                        SET canceled = 1
                        WHERE participant_id = old.participant_id;
                    ELSE
                        UPDATE payment
                        SET canceled = 0
                        WHERE participant_id = old.participant_id;
                    END IF;
                END
                """)

### Calculate the bill amount 
We have a table payment which basiclly stores information about various types of features such as stay, drinks, etc opted by the participant. The table does not calculate the actual bill for each participant. This can be achieved using a procedure. We now create a procedure that takes the participant_id as an input and calculates the bill. The output will be another table which displays the participant name (first and last name), the type of features the participant opted, and the bill amount that needs to be paid.


Before we generate the bill, a check needs to be performed. We need to ensure that the participant has not yet canceled the participation. That means the column 'canceled' in the table payment should be 0. This check can be done using the CASE statement. If the 'canceled' column is 0 for the participant, we can generate the bill, else we need to provide information that the booking is canceled. The output table should display the appropriate information.

In [498]:
# Create procedure to calculate the total bill amount
cursor.execute("""
                CREATE PROCEDURE generate_bill(
                IN p_id INT             
                )
                BEGIN
                    SELECT p.first_name, p.last_name, s.type AS stay_type, d.description AS drinks_type, f.type as food_type,
                    CASE pt.canceled
                        WHEN 0 THEN (IFNULL(s.price,0)+IFNULL(d.price,0)+IFNULL(f.price,0)) 
                        ELSE 'Booking Canceled' 
                    END AS payment_amt
                    FROM participants p
                    JOIN payment pt
                    ON p.participant_id = pt.participant_id
                    JOIN stay s
                    ON pt.stay_id = s.stay_id
                    JOIN food f
                    ON pt.food_id = f.food_id
                    JOIN drinks d
                    ON pt.drinks_id = d.drinks_id
                    WHERE pt.participant_id = p_id;
                END
                """)

### Reading the input file
The input file is saved in '.csv' format. We need to fetch the data from this file before we can distribute them into different tables the we created earlier. There are several ways to achieve this. One of them would be to convert the '.csv' into a pandas dataframe and then distribute the required data from this dataframe to the respective tables.

In [499]:
data = pd.read_csv('data.csv', index_col='ID')
data.head()

,First_Name,Last_Name,House_No,Street,City,Country,Postal_Code,Email,Contact_No,Food,Drinks,Stay,Booking_Date,Roll
ID,,,,,,,,,,,,,,
1,Raymond,Methven,78,Rockefeller,Kassel,Germany,34132,rmethven0@posterous.com,+49 457 483 6533,Buffet_Veg,L,House,2020-09-10,Guest
2,Rosemaria,Filpi,78,Rockefeller,Kassel,Germany,34132,rmethven0@posterous.com,+49 457 483 6533,Buffet_Veg,L,House,2020-09-11,Child
3,Julie,Egdal,78,Rockefeller,Kassel,Germany,34132,rmethven0@posterous.com,+49 457 483 6533,Buffet_Veg,L,House,2020-09-12,Child
4,Far,Edeson,78,Rockefeller,Kassel,Germany,34132,edesonfar@posterous.com,+49 786 610 1095,Buffet_Veg,L,House,2020-09-13,Guest
5,Roxane,Ellwood,43,Sundown,Z端rich,Switzerland,8004,rellwood4@exblog.jp,+41 824 249 0505,Buffet_Veg,S,Tent,2020-09-14,Guest

### Distributing data into various tables
Now that we read the input file and converted it into a dataframe, the next step is to distribute them into respective tables. We can achieve this by reading each entry using a for loop and then distributing the entries into respective tables.
First we will distribute data into the tables participants, contact and address.

In [500]:
# Insert data into participant, contact and address tables
for i in range(1, len(data)+1):
    house_no = data.loc[i, 'House_No'].astype(str)
    postal_code = data.loc[i, 'Postal_Code'].astype(str)
    
    # Insert data into table partbicipants
    cursor.execute("""
                    INSERT INTO participants(participant_id, first_name, last_name, booking_date)
                    VALUES(%s, %s, %s, %s)""", 
                   (i, data.loc[i,'First_Name'], data.loc[i, 'Last_Name'], data.loc[i, 'Booking_Date'])
                  )
    
    try:
    # Insert data into table contact
        cursor.execute("""
                        INSERT INTO contact(email, contact_number)
                        VALUES(%s, %s)""",
                        (data.loc[i,'Email'], data.loc[i,'Contact_No'])    
                      )
     
    # Insert data into table address
        cursor.execute("""
                        INSERT INTO address(house_no, street, city, postal_code, country)
                        VALUES(%s, %s, %s, %s, %s)""",
                        (house_no, data.loc[i,'Street'], data.loc[i,'City'], postal_code, data.loc[i,'Country'])
                      )   
    except:
        pass

    conn.commit()

The table participants also have columns address_id, contact_id and roll_id. Now the tables address, contact and roll already have data, we can fetch the ids from the respective tables. To fetch these ids we can make use of the procedures which we created earlier.

In [501]:
# Insert address_id, contact_id and roll_id into table participants
for i in range(1, len(data)+1):
    house_no = data.loc[i, 'House_No'].astype(str)
    postal_code = data.loc[i, 'Postal_Code'].astype(str)
    
    val_address = (house_no, data.loc[i, 'Street'], data.loc[i, 'City'], 
               postal_code, data.loc[i, 'Country'], 0)
    add_id = cursor.callproc('get_address_id', val_address)
    
    val_contact = (data.loc[i, 'Email'], data.loc[i, 'Contact_No'], 0)
    cont_id = cursor.callproc('get_contact_id', val_contact)

    val_roll = (data.loc[i, 'Roll'], 0)
    r_id = cursor.callproc('get_roll_id', val_roll)
    
    cursor.execute("""
                    UPDATE participants
                    SET address_id = %s, contact_id = %s, roll_id = %s
                    WHERE participant_id = %s""",
                    (add_id[5], cont_id[2], r_id[1], i)
                    )
    conn.commit()

As we know the table payment generates the billing information for each participant, it stores data in the form of various ids. In order to update table payment, we need to fetch the ids from the respective tables. We can make of the procedures we created earlier for this purpose.

In [502]:
# Insert entries into table payment
for i in range(1, len(data)+1):
    val_stay = (data.loc[i, 'Stay'], 0) # 0 is for the out parameter
    s_id = cursor.callproc('get_stay_id', val_stay)
    
    val_food = (data.loc[i, 'Food'], 0) # 0 is for the out parameter
    f_id = cursor.callproc('get_food_id', val_food)
    
    val_drinks = (data.loc[i, 'Drinks'], 0) # 0 is for the out parameter
    d_id = cursor.callproc('get_drinks_id', (val_drinks))
    
    cursor.execute("""
                   INSERT INTO payment(participant_id, stay_id, food_id, drinks_id)
                   VALUES(%s, %s, %s, %s)""", 
                   (i, s_id[1], f_id[1], d_id[1])
                  )
    conn.commit()

### Creating functions
The contact number saved in the table contact is including the country code. We can write functions that will separate the country code and the phone number. This function can be later used for query purpose.

In [503]:
# Create function to extract country code from the contact number
cursor.execute("""
                CREATE FUNCTION get_country_code(
                contact_no VARCHAR(30)
                )
                RETURNS VARCHAR(8)
                DETERMINISTIC
                BEGIN
                    DECLARE c_code VARCHAR(10);
                    SET c_code = SUBSTRING_INDEX(contact_no, ' ', 1);    
                    RETURN c_code;
                END
                """)

In [504]:
# Create function to extract telephone number from the contact number
cursor.execute("""
                CREATE FUNCTION get_phone_number(
                contact_no VARCHAR(30)
                )
                RETURNS VARCHAR(20)
                DETERMINISTIC
                BEGIN
                    DECLARE ph_no NVARCHAR(20);
                    SET ph_no = RIGHT(contact_no, CHAR_LENGTH(contact_no)-POSITION(' ' IN contact_no));
                    RETURN ph_no;
                END
                """)

### Closing the connection
Now that the database is ready with all the information, we can close the connection

In [505]:
conn.close()

### Let's get the questions answered

We can now get the questions answered by using query. Here we can make use of Jupyter inline property to see the query results.

At first we need to establish the connection.

In [506]:
# replace 'password' with your password 
sqlalchemy.create_engine('mysql+pymysql://root:password@localhost/event_planner')

Engine(mysql+pymysql://root:***@localhost/event_planner)

In [507]:
# replace 'password' with your password 
%%capture
%load_ext sql
%sql mysql+pymysql://root:password@localhost/event_planner

### Anwering queries from single table
We will try to identify total participants per month. This is a very useful information to understand the peak time for the year. This information help us to prepare for the next year.

To get this information, we can make use of aggregate and built-in functions.

In [508]:
%%sql
SELECT MONTHNAME(booking_date) AS Month, COUNT(participant_id) AS Total_Participants
FROM participants
GROUP BY Month
ORDER BY Total_Participants DESC;

 * mysql+pymysql://root:***@localhost/event_planner
4 rows affected.

[('October', 31), ('November', 30), ('September', 21), ('December', 18)]

### Answering queries by joining multiple tables

We want understand which type of stay was commonly preferred among the participants.

In [509]:
%%sql
SELECT type AS Stay_Type, COUNT(payment_id) AS Total
FROM payment p
JOIN stay s
ON p.stay_id = s.stay_id
GROUP BY Type
ORDER BY Total DESC;

 * mysql+pymysql://root:***@localhost/event_planner
3 rows affected.

[('House', 43), ('Tent', 31), ('Camper', 26)]

Now we are interested to know the visitor count based on their country

In [510]:
%%sql
SELECT country, COUNT(participant_id) AS Total
FROM address a
JOIN participants p
ON a.address_id = p.address_id
GROUP BY country
ORDER BY Total DESC;

 * mysql+pymysql://root:***@localhost/event_planner
3 rows affected.

[('Germany', 75), ('Austria', 16), ('Switzerland', 9)]

So we have seen from the result of the previous query that we have more participants from Germany. Now let us dig more on this. Let's find out top five cities from Germany from where most of the participants visit.

In [511]:
%%sql
SELECT city, COUNT(participant_id) AS Total
FROM address a 
JOIN participants p
ON a.address_id = p.address_id
WHERE a.country = 'Germany'
GROUP BY city
ORDER BY Total DESC
LIMIT 5;

 * mysql+pymysql://root:***@localhost/event_planner
5 rows affected.

[('Berlin', 12),
 ('Dresden', 7),
 ('M端lheim an der Ruhr', 6),
 ('Kassel', 5),
 ('Stuttgart', 4)]

### Answering queries with the help of created functions
Contact numbers with the country code and telephone number separated for all the participants who have roll as 'Collaborator'

In [512]:
%%sql
SELECT first_name, last_name, get_country_code(contact_number) AS c_code, get_phone_number(contact_number) AS tel_num
FROM participants p
JOIN contact c 
ON p.contact_id = c.contact_id
JOIN roll r
ON p.roll_id = r.roll_id
WHERE r.description = 'Collaborator';

 * mysql+pymysql://root:***@localhost/event_planner
39 rows affected.

[('Nealon', 'Ubsdell', '+49', '394 599 0756'),
 ('Fan', 'Murch', '+49', '772 956 3111'),
 ('Carolee', 'Thaim', '+49', '303 640 8233'),
 ('Kirsteni', 'Sturge', '+49', '628 954 2514'),
 ('Kelwin', 'Skirving', '+49', '579 843 6353'),
 ('Jessalin', 'Trobe', '+49', '471 193 9845'),
 ('Bear', 'Cowden', '+49', '328 307 5853'),
 ('Cthrine', 'Lambotin', '+49', '389 574 1679'),
 ('Sharla', 'Kilfedder', '+49', '776 872 6676'),
 ('Cinderella', 'Laetham', '+49', '921 136 3249'),
 ('Dorette', 'Wadham', '+49', '983 590 2623'),
 ('Charmian', 'Mullins', '+43', '485 251 0000'),
 ('Nanette', 'Wagner', '+49', '430 945 9002'),
 ('Shawn', 'Stailey', '+49', '547 433 1584'),
 ('Lona', 'Lorimer', '+49', '102 219 0950'),
 ('Vally', 'Krollman', '+43', '475 761 6234'),
 ('Patten', 'Bittlestone', '+49', '427 390 0101'),
 ('Lily', 'Belcham', '+49', '265 129 0963'),
 ('Ange', 'Scrivens', '+49', '336 674 5778'),
 ('Nick', 'Clayhill', '+49', '867 544 4264'),
 ('Maurine', 'Damiral', '+49', '530 373 0821'),
 ('Abbe', 'Crossman', '+49', '384 764 9185'),
 ('Rafaela', 'Wistance', '+49', '813 755 1452'),
 ('Cindy', 'Adshede', '+49', '135 801 4924'),
 ('Cordy', 'Dumbare', '+49', '562 181 3937'),
 ('Hans', 'Sedgeworth', '+49', '818 428 0299'),
 ('Caty', 'Senogles', '+49', '919 254 2948'),
 ('Charita', 'Tulley', '+41', '727 567 9081'),
 ('Mallissa', 'Cobbold', '+49', '560 464 2747'),
 ('Lissie', 'Kingscote', '+49', '716 241 7922'),
 ('Victoria', 'Pavyer', '+49', '612 438 0009'),
 ('Kelwin', 'Gryglewski', '+49', '887 411 4234'),
 ('Christie', 'Smurthwaite', '+49', '489 872 0145'),
 ('Cathleen', 'Didball', '+41', '415 475 4475'),
 ('Thea', 'Embra', '+49', '170 238 9263'),
 ('Corbie', 'Bourdice', '+41', '255 851 8477'),
 ('Margalit', 'Josofovitz', '+49', '971 315 3313'),
 ('Norrie', 'Berling', '+49', '571 895 6785'),
 ('Willem', 'Rispin', '+49', '919 871 9466')]

### Calculate the final bill 
We already created a procedure for perform this task. We can use this procedure to generate the bill amount.

In [513]:
%%sql
CALL generate_bill(100)

 * mysql+pymysql://root:***@localhost/event_planner
1 rows affected.

[('Willem', 'Rispin', 'Camper', 'Medium', 'Buffet_Veg', '65')]

### Testing the Trigger

We created a trigger that would update the column 'canceled' of table payment to 1 whenever the 'cancellation_date' of table participants is updated. Let's test this now.

We have information that a participant Roxane Ellwood whose participant_id is 5 canceled his participation. Let's update this information to the table participants and see how the trigger is working.

In [520]:
%%sql
UPDATE participants
SET cancellatation_date = '2020-09-01'
WHERE participant_id = 5

 * mysql+pymysql://root:***@localhost/event_planner
1 rows affected.

[]

In [515]:
%%sql
SELECT * 
FROM participants
WHERE participant_id = 5

 * mysql+pymysql://root:***@localhost/event_planner
1 rows affected.

[(5, 'Roxane', 'Ellwood', 3, 5, datetime.date(2020, 9, 14), datetime.date(2020, 9, 1), 1)]

In [521]:
%%sql
SELECT * 
FROM payment
WHERE participant_id = 5

 * mysql+pymysql://root:***@localhost/event_planner
1 rows affected.

[(5, 5, 1, 1, 1, 1)]

So we can see from the above result that the trigger has functioned correctly thereby update the 'canceled' column of table payment to 1.

Now let us try to generate the bill for the canceled participant. This CASE statement of the procedure generate_bill checks this and updates the output table accordingly. Let's check if that works fine.

In [522]:
%%sql
CALL generate_bill(5)

 * mysql+pymysql://root:***@localhost/event_planner
1 rows affected.

[('Roxane', 'Ellwood', 'Tent', 'Small', 'Buffet_Veg', 'Booking Canceled')]

### Conclusion

Through this project we were able to understand some of the important concepts of SQL and also how to do this in Jupyter. We were able to understand the following concepts:

- create database, 
- create tables,
- add various constraints,
- add relationship among tables,
- insert data into table,
- fetch data from table,
- create procedures, functions and triggers,
- find answers from single table or multiple tables by joining them.  

Hope you enjoyed this project.